app/controllers/statuses_controller.rb

  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "greg"], ["content", "Im on Treebook"], ["created_at", "2015-04-21 16:42:46.159513"], ["updated_at", "2015-04-21 16:42:46.159513"]]

  def update
    respond_to do |format|
      if @status.update(status_params)
---
UPDATE "statuses" SET "content" = ?, "updated_at" = ? WHERE "statuses"."id" = ?  [["content", "im getting there"], ["updated_at", "2015-04-21 22:54:30.540411"], ["id", 4]]

  def destroy
    @status.destroy
---
DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]

    def set_status
      @status = Status.find(params[:id])
---
SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", 1]]